# Character, Number, Date, and Group functions
---

### Connecting with the database

In [ ]:
%load_ext sql
# replace with your own credentials
%sql ibm_db_sa://my-username:my-password@dashdb-txn-sbox-yp-dal09-03.services.dal.bluemix.net:50000/BLUDB

### • <u>GROUP FUNCTIONS</u>

`Group functions` (also called `aggregate functions`) are mathematical functions to operate on sets of rows to give one result per set.

### 1. AVG Function
It returns the average of the values in the selected columns.

In [2]:
%sql select * from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('United States', 'Marshall', 'Bernadot', 54),
 ('United States', 'Celinda', 'Malkin', 51),
 ('Ukraine', 'Guillermo', 'Furze', 53),
 ('Ukraine', 'Aharon', 'Tunnow', 48),
 ('Russia', 'Bail', 'Goodwin', 46),
 ('Poland', 'Cole', 'Winteringham', 49),
 ('Sweden', 'Emlyn', 'Erricker', 55),
 ('Russia', 'Cathee', 'Sivewright', 49),
 ('Poland', 'Barny', 'Ingerson', 57),
 ('Sweden', 'Sharla', 'Papaccio', 55)]

In [3]:
%sql select avg(test_score) from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('51.700000'),)]

In [4]:
%sql select avg(test_score) as average_marks from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('51.700000'),)]

### 2. MIN Function
Returns the data from the row in which the specified column contains the minimum value.

In [5]:
%sql select min(test_score) as min_marks from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(46,)]

### 3. MAX Function
Returns the data of the row in which the specified column contains the maximum value.

In [6]:
%sql select max(test_score) as max_marks from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(57,)]

### 4. SUM Function
Returns the total of all the values in a specified column.

In [7]:
%sql select sum(test_score) as toal_marks from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(517,)]

### 5. COUNT Function
It adds the number of rows that matches the criteria specified in the select statement.

In [8]:
%sql select count(*) as no_of_rows from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('10'),)]

### • <u>CURRENT DATE AND TIME</u>

The most difficult part when working with dates is to be sure that the format of the date you are trying to insert, matches the format of the date column in the database. As long as your data contains only the date portion, your queries will work as expected. However, if a time portion is involved, it gets complicated.

### 1. NOW
This function returns the current date and time of the system.

In [9]:
%sql select now() as current_date_time from STUDENTS where test_score=54

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(datetime.datetime(2020, 11, 12, 10, 40, 45, 698828),)]

### 2. CURDATE 
Returns the current date of the system.

In [10]:
%sql VALUES CURRENT DATE

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(datetime.date(2020, 11, 12),)]

### 3. CURTIME
Returns the current time of the system.

In [11]:
%sql VALUES CURRENT TIME

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(datetime.time(10, 40, 47),)]

### • <u>CHARACTER FUNCTIONS</u>
Character functions accept character inputs and can return either characters or number values as output.

### 1. ASCII
Returns the ASCII code of the leftmost character of the string passed.

In [12]:
%sql select first_name, ascii(first_name) as ascii_fname from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Marshall', 77),
 ('Celinda', 67),
 ('Guillermo', 71),
 ('Aharon', 65),
 ('Bail', 66),
 ('Cole', 67),
 ('Emlyn', 69),
 ('Cathee', 67),
 ('Barny', 66),
 ('Sharla', 83)]

### 2. CHAR
Returns the character of ineteger.

In [13]:
%sql VALUES chr('23')

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('\x17',)]

### 3. CONCAT
Returns the string that results from the concatenation of the arguments.

In [14]:
%sql select concat(first_name, last_name) as name from STUDENTS where test_score=54

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('MarshallBernadot',)]

### 4. INSTR
Returns the location of the specified substring in a string.

In [15]:
%sql select instr('quadratic', 'dra') as at_index from STUDENTS where test_score=54

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(4,)]

### 5. INSERT
Inserts a substring into a string at the specified position.

In [16]:
%sql select insert('quadratic',3,4, 'what') from STUDENTS where test_score=54

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('quwhattic',)]

### 6. LENGTH
Returns the length of the string.

In [17]:
%sql select first_name, length(first_name) as length from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Marshall', 8),
 ('Celinda', 7),
 ('Guillermo', 9),
 ('Aharon', 6),
 ('Bail', 4),
 ('Cole', 4),
 ('Emlyn', 5),
 ('Cathee', 6),
 ('Barny', 5),
 ('Sharla', 6)]

### 7. LOWER
Converts all the letters to lower case.

In [18]:
%sql select lower('HELLO') from STUDENTS where test_score=54

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('hello',)]

### 8. UPPER
Converts all the letters to upper case.

In [19]:
%sql select upper('hello') from STUDENTS where test_score=54

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('HELLO',)]

### • <u>NUMBER FUNCTIONS</u>
SQL numeric functions are used primarily for numeric manipulation and/or mathematical calculations.

### 1. POWER (X,Y)
Returns the value of x raised to the power of y.

In [20]:
%sql VALUES POWER(5, 2)

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(25,)]

### 2. Round (M,N)
Returns M round to N places to the right of decimal.

In [21]:
%sql VALUES ROUND(873.729, 1)

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('873.700'),)]

### 3. SQRT (N)
Returns the square root of N.

In [22]:
%sql VALUES SQRT(25)

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(5.0,)]

### 4. EXP (N)

In [23]:
%sql VALUES EXP(3)

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(20.085536923187668,)]

### 5. MOD (N,M)

In [24]:
%sql VALUES MOD(125, 50)

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(25,)]

### 6. FLOOR

In [25]:
%sql VALUES FLOOR(3.35)

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('3'),)]

### 7. CEIL

In [26]:
%sql VALUES Ceiling(3.35)

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('4'),)]

## Thanks for reading :)
Created by [Tarun Kamboj](https://www.linkedin.com/in/kambojtarun/).